app/controllers/main_controller.rb

	def index
		ingredient_names = params["ingredients"]
		if ingredient_names
			ingredient_name_array = ingredient_names.split(",")
			@ingredient_array = Array.new
			ingredient_name_array.each{|ingredient_name|
				i = Ingredient.find_by_name ingredient_name
---
SELECT * FROM "ingredients" WHERE ("ingredients"."name" = 'keys') LIMIT 1